# 빅데이터 분석기사 실기 준비를 위한 캐글 놀이터
https://www.kaggle.com/datasets/agileteam/bigdatacertificationkr?resource=download

### 이상치(IQR) ⭐⭐⭐

#### 데이터에서 IQR을 활용해 Fare컬럼의 이상치를 찾고, 이상치 데이터의 여성 수를 구하시오
강의 영상 : https://youtu.be/ipBW5D_UJEo  
데이터셋 : Titanic  
데이터 위치 "../data/Titanic.csv"

In [1]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np
df = pd.read_csv("../data/Titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
# 간단한 탐색적 데이터 분석 (EDA)
print(df.shape)
print(df.describe())
print(df.isnull().sum())
df.head()

(891, 12)
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# IQR 구하기
Q1 = df["Fare"].quantile(0.25)
Q3 = df["Fare"].quantile(0.75)
IQR = Q3 - Q1

print(Q1 - 1.5 * IQR, Q3 + 1.5 * IQR)

-26.724 65.6344

In [4]:
# 이상치 데이터 구하기
outdata1 = df[df["Fare"] < Q1 - 1.5 * IQR]
outdata2 = df[df["Fare"] > Q3 + 1.5 * IQR]

print(len(outdata1), len(outdata2))

0 116

In [5]:
# 이상치 데이터에서 여성 수 구하기, 출력하기 print()
print(len(outdata2[outdata2["Gender"] == "female"]))

70

### 이상치(소수점 나이) ⭐⭐⭐

#### 이상치를 찾아라(소수점 나이)
주어진 데이터에서 이상치(소수점 나이)를 찾고 올림, 내림, 버림(절사)했을때 3가지 모두 이상치 'age' 평균을 구한 다음 모두 더하여 출력하시오  
데이터셋 : basic1.csv  
강의 영상 : https://youtu.be/c3Fr9G-ZYdw

In [6]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.read_csv("../data/basic1.csv")
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [7]:
# 소수점 데이터 찾기
df[df["age"] != df["age"].astype("int")]

      id   age city    f1  f2   f3    f4         f5
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
21  id22  -6.3   부산  72.0   1  NaN  ENFP  52.667078
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
46  id47  34.6   대구  75.0   1  NaN  ESTJ  90.496999
64  id65  26.5   경기   NaN   0  NaN  ISFP  91.297791
84  id85  83.6   경기  55.0   0  NaN  INFJ  80.138280
92  id93  21.8   경기  57.0   0  NaN  ISFP  73.586397

In [8]:
# 이상치를 포함한 데이터 올림, 내림, 버림의 평균값 
# 올림
m_ceil = np.ceil(df["age"]).mean()

# 내림
m_floor = np.floor(df["age"]).mean()

# 버림
m_trunc = np.trunc(df["age"]).mean()

print(m_ceil, m_floor, m_trunc)

51.0 50.92 50.94

In [9]:
# 평균값 더한 다음 출력
print(m_ceil + m_floor + m_trunc)

152.86

### 결측치 처리 ⭐⭐⭐

#### 결측치 처리
주어진 데이터에서 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 'f1'컬럼의 평균값을 출력하세요!
데이터셋 : basic1.csv  
강의 영상 : https://youtu.be/WqlpqBRn7x4

In [10]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.read_csv("../data/basic1.csv")
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [11]:
# EDA - 결측값 확인(비율 확인)
print(df.shape)
print(df.isnull().sum() / len(df))

(100, 8)
id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [12]:
# 80%이상 결측치 컬럼, 삭제
print("삭제 전:", df.shape)
df = df.drop(["f3"], axis = 1)
print("삭제 후:", df.shape)

삭제 전: (100, 8)
삭제 후: (100, 7)

In [13]:
# 80%미만 결측치 컬럼, city별 중앙값으로 대체
print(df["city"].unique())

## city별 중앙값 계산
s_md, b_md, d_md, k_md = df.groupby("city")["f1"].median()

## 중앙값 대체
df2 = df.copy()
df2["f1"] = df2["f1"].fillna(df["city"].map({"서울" : s_md, "부산" : b_md, "대구" : d_md, "경기" : k_md}))
display(df[18:21])
display(df2[18:21])

['서울' '부산' '대구' '경기']

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울   NaN   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산   NaN   1  ISFP  29.269869

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울  58.0   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산  75.0   1  ISFP  29.269869

In [15]:
# f1 평균값 결과 출력
print(df["f1"].mean()) # 총 평균
print(df.groupby("city")["f1"].mean()) # 도시별 평균

66.04347826086956
city
경기    62.551724
대구    74.846154
부산    62.583333
서울    67.933333
Name: f1, dtype: float64

### 왜도/첨도 (로그스케일) ⭐

### 표준편차 ⭐⭐⭐

### Groupby 합계 ⭐⭐⭐

### 값 변경 ⭐⭐⭐

###  누적합/보간 ⭐⭐⭐

### 표준화 (중앙값) ⭐⭐⭐

###  Yeo-Johnson & Box-Cox ⭐

### min-max scaling ⭐⭐⭐

###  상하위 10개 추출 ⭐⭐⭐

### 상과관계 ⭐⭐⭐

### MultiIndex + Groupby ⭐⭐⭐

### 조건 필터림 + 중앙값 대체 ⭐⭐⭐

### 분산 계산 ⭐⭐⭐

### 시계열1 (datetime) ⭐⭐⭐

### 시계열2 (평일/주말) ⭐⭐⭐

### 시계열3 (월별 총계) ⭐⭐⭐

### 데이터 병합 ⭐

### Binning Data ⭐

### 시계열 (Weekly) ⭐⭐⭐

### 중복 제거 및 결측치 처리 ⭐⭐⭐

### Lagged Feature

### 문자열 처리 (슬라이싱)

### 문자열 포함 여부

### 문자열 치환

### 빈도 계산 (value_counts)

### 날짜 형식 변환

### 시계열 비율 계산

### Melt 전체

### Melt 일부

### Timedelta 계산

### 패턴/선호도 분석 (난이도 : 상)

### 피드백-문자와 시계열 (난이도 : 중)